In [2]:
import pandas as pd
import numpy as np
df1 = pd.DataFrame()   # empty DataFrame
df1

Empty DataFrame
Columns: []
Index: []

In [12]:
# created a dictionary
d1 =  { 'students':['ruchika','neha','mark','gurjyot','jamaal'],
        'marks':[79.5,83.75,74,88.5,89],
        'sport':['cricket','badminton','football','athletics','kabaddi'],
        'roll': [1,2,3,4,5]
      }


d1

{'students': ['ruchika', 'neha', 'mark', 'gurjyot', 'jamaal'],
 'marks': [79.5, 83.75, 74, 88.5, 89],
 'sport': ['cricket', 'badminton', 'football', 'athletics', 'kabaddi'],
 'roll': [1, 2, 3, 4, 5]}

In [13]:
df = pd.DataFrame(d1)
df

  students  marks      sport  roll
0  ruchika  79.50    cricket     1
1     neha  83.75  badminton     2
2     mark  74.00   football     3
3  gurjyot  88.50  athletics     4
4   jamaal  89.00    kabaddi     5

In [14]:
print(df)

  students  marks      sport  roll
0  ruchika  79.50    cricket     1
1     neha  83.75  badminton     2
2     mark  74.00   football     3
3  gurjyot  88.50  athletics     4
4   jamaal  89.00    kabaddi     5